martinroger/superPod/sdkconfig.defaults
# Espressif IoT Development Framework (ESP-IDF) 6.2 Project Configuration for superPod
CONFIG_IDF_TARGET="esp32s3"

# Compiler & System Options
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y
CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING=y
CONFIG_FREERTOS_HZ=1000

# PSRAM / SPIRAM Settings
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Bluetooth Bluedroid & A2DP Stack Configuration
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLE=y
CONFIG_BT_CLASSIC_ENABLED=y
CONFIG_BT_A2DP_ENABLE=y
CONFIG_BT_AVRC_ENABLED=y
CONFIG_BT_CTRL_PIN_TO_CORE=0
CONFIG_BT_BLUEDROID_PIN_TO_CORE=0

# TinyUSB Configuration (esp_tinyusb v2.0+)
CONFIG_TINYUSB_TASK_CORE=1
CONFIG_TINYUSB_TASK_PRIORITY=15
CONFIG_TINYUSB_DESC_CUSTOM_VID=0x067B
CONFIG_TINYUSB_DESC_CUSTOM_PID=0x2303
CONFIG_TINYUSB_DESC_BCD_DEVICE=0x0400
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="Spoolific"
CONFIG_TINYUSB_DESC_PRODUCT_STRING="superPod-PL2303"
CONFIG_TINYUSB_VENDOR_COUNT=1

# GPIO Control Pins
CONFIG_DTR_PIN=5
CONFIG_RTS_PIN=6

# I2S Audio Pin Configurations
CONFIG_I2S_BCLK_PIN=27
CONFIG_I2S_WS_PIN=25
CONFIG_I2S_DOUT_PIN=26
CONFIG_A2DP_SINK_NAME="superPod-A2DP"
